#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.workspace.data.sops_file.variables: Reading...
module.workspace.data.sops_file.variables: Read complete after 0s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.workspace.tfe_variable.env_secret["ENVIRONMENT_SCRET"] will be created
  + resource "tfe_variable" "env_secret" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_SCRET"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.env_secret["ENVIRONMENT_SCRT_MAP"] will be created
  + resource "tfe_variable" "env_secret" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_SCRT_MAP"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.env_secret["ENVIRONMENT_SECRT_LIST"] will be created
  + resource "tfe_variable" "env_secret" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_SECRT_LIST"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.env_variable["ENVIRONMENT_VARIABLE"] will be created
  + resource "tfe_variable" "env_variable" {
      + category     = "terraform"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_VARIABLE"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.env_variable["ENVIRONMENT_VARIABLE_LIST"] will be created
  + resource "tfe_variable" "env_variable" {
      + category     = "terraform"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_VARIABLE_LIST"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.env_variable["ENVIRONMENT_VARIABLE_MAP"] will be created
  + resource "tfe_variable" "env_variable" {
      + category     = "terraform"
      + hcl          = false
      + id           = (known after apply)
      + key          = "ENVIRONMENT_VARIABLE_MAP"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_secret["scret_list"] will be created
  + resource "tfe_variable" "terraform_secret" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "scret_list"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_secret["secrt_map"] will be created
  + resource "tfe_variable" "terraform_secret" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "secrt_map"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_secret["terraform_scrt"] will be created
  + resource "tfe_variable" "terraform_secret" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "terraform_scrt"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_variable["terraform_list"] will be created
  + resource "tfe_variable" "terraform_variable" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "terraform_list"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_variable["terraform_map"] will be created
  + resource "tfe_variable" "terraform_variable" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "terraform_map"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_variable.terraform_variable["terraform_variable"] will be created
  + resource "tfe_variable" "terraform_variable" {
      + category     = "terraform"
      + hcl          = true
      + id           = (known after apply)
      + key          = "terraform_variable"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.workspace.tfe_workspace.workspace will be created
  + resource "tfe_workspace" "workspace" {
      + allow_destroy_plan            = (sensitive)
      + auto_apply                    = (sensitive)
      + description                   = (sensitive)
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = (sensitive)
      + operations                    = (known after apply)
      + organization                  = (sensitive)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = (sensitive)
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "terraform",
          + "test",
        ]
      + terraform_version             = (sensitive)
      + trigger_prefixes              = (known after apply)

      + vcs_repo {
          + branch             = (sensitive)
          + identifier         = (sensitive)
          + ingress_submodules = false
          + oauth_token_id     = (sensitive)
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pipo-flufi, Action: `pull_request`, Working Directory: ``, Workflow: `terraform validate`*